In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('http://bit.ly/smallstocks')
df.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT

In [32]:
df.set_index(['Symbol', 'Date']).sort_index().unstack(0)

             Close                  Volume
Symbol        AAPL   CSCO   MSFT      AAPL      CSCO      MSFT
Date
2016-10-03  112.52  31.50  57.42  21701800  14070500  19189500
2016-10-04  113.00  31.35  57.24  29736800  18460400  20085900
2016-10-05  113.05  31.59  57.64  21453100  11808600  16726400

In [50]:
df0 = df.set_index(['Symbol', 'Date'])
df0.loc[['CSCO'], 'Close']

Symbol  Date
CSCO    2016-10-03    31.50
        2016-10-04    31.35
        2016-10-05    31.59
Name: Close, dtype: float64

In [38]:
df2 = df.groupby(['Symbol', 'Date']).Close.mean().unstack(0) #unstack converts the multi-index series to a df
df2.head()

Symbol        AAPL   CSCO   MSFT
Date
2016-10-03  112.52  31.50  57.42
2016-10-04  113.00  31.35  57.24
2016-10-05  113.05  31.59  57.64

In [20]:
df2 = df.groupby(['Symbol', 'Date']).Close.mean().unstack() #unstack converts the multi-index series to a df
df2.head()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [21]:
df2 = df.groupby(['Symbol', 'Date'], as_index = False).Close.mean() #unstack converts the multi-index series to a df
df2.head()

  Symbol        Date   Close
0   AAPL  2016-10-03  112.52
1   AAPL  2016-10-04  113.00
2   AAPL  2016-10-05  113.05
3   CSCO  2016-10-03   31.50
4   CSCO  2016-10-04   31.35

In [65]:
df2.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [75]:
df2.loc['AAPL', '2016-10-03']

112.52

In [77]:
df2.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: 2016-10-03, dtype: float64

In [67]:
# single index
df3 = df.set_index('Symbol')
df3.head()

              Date   Close    Volume
Symbol
CSCO    2016-10-03   31.50  14070500
AAPL    2016-10-03  112.52  21701800
MSFT    2016-10-03   57.42  19189500
AAPL    2016-10-04  113.00  29736800
MSFT    2016-10-04   57.24  20085900

In [68]:
# single index
df3.loc['CSCO', 'Date' : 'Volume']

              Date  Close    Volume
Symbol
CSCO    2016-10-03  31.50  14070500
CSCO    2016-10-04  31.35  18460400
CSCO    2016-10-05  31.59  11808600

In [69]:
# multi index
df4 = df.set_index(['Symbol', 'Date'])
df4.head()

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900

In [83]:

df4.sort_index(inplace=True)
df4

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [91]:
#pass in multi index rows as a tuple i.e. in () brackets
df4.loc[('AAPL', ['2016-10-03','2016-10-04']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800

In [92]:
df4.loc[('AAPL', ['2016-10-03','2016-10-04']), 'Volume']

Symbol  Date
AAPL    2016-10-03    21701800
        2016-10-04    29736800
Name: Volume, dtype: int64

In [93]:
 # this doesn't work! only for columns allowed
df4.loc[('AAPL', '2016-10-03''2016-10-05'), :]

SyntaxError: invalid syntax (<ipython-input-93-bdeeb6b269c5>, line 1)

In [96]:
# to get all stocks do this
df4.loc[(slice(None), ['2016-10-03','2016-10-05']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-05   57.64  16726400

In [70]:
df4.loc['CSCO', '2016-10-03']

Close           31.5
Volume    14070500.0
Name: (CSCO, 2016-10-03), dtype: float64

In [71]:
df.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT

In [74]:
df.loc[df.Symbol == "CSCO"]

         Date  Close    Volume Symbol
0  2016-10-03  31.50  14070500   CSCO
5  2016-10-04  31.35  18460400   CSCO
7  2016-10-05  31.59  11808600   CSCO